name: "resnet18-cifar10"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.0078125
    mirror: true
    crop_size: 32
    mean_value: 128
  }
  data_param {
    source: "cifar-10-batches-py/train"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.0078125
    mean_value: 128
  }
  data_param {
    source: "cifar-10-batches-py/test"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "first_conv"
  type: "Convolution"
  bottom: "data"
  top: "first_conv"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "first_conv_bn"
  type: "BatchNorm"
  bottom: "first_conv"
  top: "first_conv"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "first_conv_scale"
  type: "Scale"
  bottom: "first_conv"
  top: "first_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "first_conv_relu"
  type: "ReLU"
  bottom: "first_conv"
  top: "first_conv"
}
layer {
  name: "group0_block0_conv0"
  type: "Convolution"
  bottom: "first_conv"
  top: "group0_block0_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block0_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block0_conv0"
  top: "group0_block0_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block0_conv0_scale"
  type: "Scale"
  bottom: "group0_block0_conv0"
  top: "group0_block0_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block0_conv0_relu"
  type: "ReLU"
  bottom: "group0_block0_conv0"
  top: "group0_block0_conv0"
}
layer {
  name: "group0_block0_conv1"
  type: "Convolution"
  bottom: "group0_block0_conv0"
  top: "group0_block0_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block0_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block0_conv1"
  top: "group0_block0_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block0_conv1_scale"
  type: "Scale"
  bottom: "group0_block0_conv1"
  top: "group0_block0_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block0_sum"
  type: "Eltwise"
  bottom: "group0_block0_conv1"
  bottom: "first_conv"
  top: "group0_block0_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block1_conv0"
  type: "Convolution"
  bottom: "group0_block0_sum"
  top: "group0_block1_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block1_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block1_conv0"
  top: "group0_block1_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block1_conv0_scale"
  type: "Scale"
  bottom: "group0_block1_conv0"
  top: "group0_block1_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block1_conv0_relu"
  type: "ReLU"
  bottom: "group0_block1_conv0"
  top: "group0_block1_conv0"
}
layer {
  name: "group0_block1_conv1"
  type: "Convolution"
  bottom: "group0_block1_conv0"
  top: "group0_block1_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block1_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block1_conv1"
  top: "group0_block1_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block1_conv1_scale"
  type: "Scale"
  bottom: "group0_block1_conv1"
  top: "group0_block1_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block1_sum"
  type: "Eltwise"
  bottom: "group0_block1_conv1"
  bottom: "group0_block0_sum"
  top: "group0_block1_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block2_conv0"
  type: "Convolution"
  bottom: "group0_block1_sum"
  top: "group0_block2_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block2_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block2_conv0"
  top: "group0_block2_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block2_conv0_scale"
  type: "Scale"
  bottom: "group0_block2_conv0"
  top: "group0_block2_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block2_conv0_relu"
  type: "ReLU"
  bottom: "group0_block2_conv0"
  top: "group0_block2_conv0"
}
layer {
  name: "group0_block2_conv1"
  type: "Convolution"
  bottom: "group0_block2_conv0"
  top: "group0_block2_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block2_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block2_conv1"
  top: "group0_block2_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block2_conv1_scale"
  type: "Scale"
  bottom: "group0_block2_conv1"
  top: "group0_block2_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block2_sum"
  type: "Eltwise"
  bottom: "group0_block2_conv1"
  bottom: "group0_block1_sum"
  top: "group0_block2_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block3_conv0"
  type: "Convolution"
  bottom: "group0_block2_sum"
  top: "group0_block3_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block3_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block3_conv0"
  top: "group0_block3_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block3_conv0_scale"
  type: "Scale"
  bottom: "group0_block3_conv0"
  top: "group0_block3_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block3_conv0_relu"
  type: "ReLU"
  bottom: "group0_block3_conv0"
  top: "group0_block3_conv0"
}
layer {
  name: "group0_block3_conv1"
  type: "Convolution"
  bottom: "group0_block3_conv0"
  top: "group0_block3_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block3_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block3_conv1"
  top: "group0_block3_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block3_conv1_scale"
  type: "Scale"
  bottom: "group0_block3_conv1"
  top: "group0_block3_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block3_sum"
  type: "Eltwise"
  bottom: "group0_block3_conv1"
  bottom: "group0_block2_sum"
  top: "group0_block3_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block4_conv0"
  type: "Convolution"
  bottom: "group0_block3_sum"
  top: "group0_block4_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block4_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block4_conv0"
  top: "group0_block4_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block4_conv0_scale"
  type: "Scale"
  bottom: "group0_block4_conv0"
  top: "group0_block4_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block4_conv0_relu"
  type: "ReLU"
  bottom: "group0_block4_conv0"
  top: "group0_block4_conv0"
}
layer {
  name: "group0_block4_conv1"
  type: "Convolution"
  bottom: "group0_block4_conv0"
  top: "group0_block4_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block4_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block4_conv1"
  top: "group0_block4_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block4_conv1_scale"
  type: "Scale"
  bottom: "group0_block4_conv1"
  top: "group0_block4_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block4_sum"
  type: "Eltwise"
  bottom: "group0_block4_conv1"
  bottom: "group0_block3_sum"
  top: "group0_block4_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block5_conv0"
  type: "Convolution"
  bottom: "group0_block4_sum"
  top: "group0_block5_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block5_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block5_conv0"
  top: "group0_block5_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block5_conv0_scale"
  type: "Scale"
  bottom: "group0_block5_conv0"
  top: "group0_block5_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block5_conv0_relu"
  type: "ReLU"
  bottom: "group0_block5_conv0"
  top: "group0_block5_conv0"
}
layer {
  name: "group0_block5_conv1"
  type: "Convolution"
  bottom: "group0_block5_conv0"
  top: "group0_block5_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block5_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block5_conv1"
  top: "group0_block5_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block5_conv1_scale"
  type: "Scale"
  bottom: "group0_block5_conv1"
  top: "group0_block5_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block5_sum"
  type: "Eltwise"
  bottom: "group0_block5_conv1"
  bottom: "group0_block4_sum"
  top: "group0_block5_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block6_conv0"
  type: "Convolution"
  bottom: "group0_block5_sum"
  top: "group0_block6_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block6_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block6_conv0"
  top: "group0_block6_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block6_conv0_scale"
  type: "Scale"
  bottom: "group0_block6_conv0"
  top: "group0_block6_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block6_conv0_relu"
  type: "ReLU"
  bottom: "group0_block6_conv0"
  top: "group0_block6_conv0"
}
layer {
  name: "group0_block6_conv1"
  type: "Convolution"
  bottom: "group0_block6_conv0"
  top: "group0_block6_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block6_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block6_conv1"
  top: "group0_block6_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block6_conv1_scale"
  type: "Scale"
  bottom: "group0_block6_conv1"
  top: "group0_block6_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block6_sum"
  type: "Eltwise"
  bottom: "group0_block6_conv1"
  bottom: "group0_block5_sum"
  top: "group0_block6_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block7_conv0"
  type: "Convolution"
  bottom: "group0_block6_sum"
  top: "group0_block7_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block7_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block7_conv0"
  top: "group0_block7_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block7_conv0_scale"
  type: "Scale"
  bottom: "group0_block7_conv0"
  top: "group0_block7_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block7_conv0_relu"
  type: "ReLU"
  bottom: "group0_block7_conv0"
  top: "group0_block7_conv0"
}
layer {
  name: "group0_block7_conv1"
  type: "Convolution"
  bottom: "group0_block7_conv0"
  top: "group0_block7_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block7_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block7_conv1"
  top: "group0_block7_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block7_conv1_scale"
  type: "Scale"
  bottom: "group0_block7_conv1"
  top: "group0_block7_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block7_sum"
  type: "Eltwise"
  bottom: "group0_block7_conv1"
  bottom: "group0_block6_sum"
  top: "group0_block7_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block8_conv0"
  type: "Convolution"
  bottom: "group0_block7_sum"
  top: "group0_block8_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block8_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block8_conv0"
  top: "group0_block8_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block8_conv0_scale"
  type: "Scale"
  bottom: "group0_block8_conv0"
  top: "group0_block8_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block8_conv0_relu"
  type: "ReLU"
  bottom: "group0_block8_conv0"
  top: "group0_block8_conv0"
}
layer {
  name: "group0_block8_conv1"
  type: "Convolution"
  bottom: "group0_block8_conv0"
  top: "group0_block8_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block8_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block8_conv1"
  top: "group0_block8_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block8_conv1_scale"
  type: "Scale"
  bottom: "group0_block8_conv1"
  top: "group0_block8_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block8_sum"
  type: "Eltwise"
  bottom: "group0_block8_conv1"
  bottom: "group0_block7_sum"
  top: "group0_block8_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block9_conv0"
  type: "Convolution"
  bottom: "group0_block8_sum"
  top: "group0_block9_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block9_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block9_conv0"
  top: "group0_block9_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block9_conv0_scale"
  type: "Scale"
  bottom: "group0_block9_conv0"
  top: "group0_block9_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block9_conv0_relu"
  type: "ReLU"
  bottom: "group0_block9_conv0"
  top: "group0_block9_conv0"
}
layer {
  name: "group0_block9_conv1"
  type: "Convolution"
  bottom: "group0_block9_conv0"
  top: "group0_block9_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block9_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block9_conv1"
  top: "group0_block9_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block9_conv1_scale"
  type: "Scale"
  bottom: "group0_block9_conv1"
  top: "group0_block9_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block9_sum"
  type: "Eltwise"
  bottom: "group0_block9_conv1"
  bottom: "group0_block8_sum"
  top: "group0_block9_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block10_conv0"
  type: "Convolution"
  bottom: "group0_block9_sum"
  top: "group0_block10_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block10_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block10_conv0"
  top: "group0_block10_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block10_conv0_scale"
  type: "Scale"
  bottom: "group0_block10_conv0"
  top: "group0_block10_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block10_conv0_relu"
  type: "ReLU"
  bottom: "group0_block10_conv0"
  top: "group0_block10_conv0"
}
layer {
  name: "group0_block10_conv1"
  type: "Convolution"
  bottom: "group0_block10_conv0"
  top: "group0_block10_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block10_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block10_conv1"
  top: "group0_block10_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block10_conv1_scale"
  type: "Scale"
  bottom: "group0_block10_conv1"
  top: "group0_block10_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block10_sum"
  type: "Eltwise"
  bottom: "group0_block10_conv1"
  bottom: "group0_block9_sum"
  top: "group0_block10_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block11_conv0"
  type: "Convolution"
  bottom: "group0_block10_sum"
  top: "group0_block11_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block11_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block11_conv0"
  top: "group0_block11_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block11_conv0_scale"
  type: "Scale"
  bottom: "group0_block11_conv0"
  top: "group0_block11_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block11_conv0_relu"
  type: "ReLU"
  bottom: "group0_block11_conv0"
  top: "group0_block11_conv0"
}
layer {
  name: "group0_block11_conv1"
  type: "Convolution"
  bottom: "group0_block11_conv0"
  top: "group0_block11_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block11_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block11_conv1"
  top: "group0_block11_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block11_conv1_scale"
  type: "Scale"
  bottom: "group0_block11_conv1"
  top: "group0_block11_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block11_sum"
  type: "Eltwise"
  bottom: "group0_block11_conv1"
  bottom: "group0_block10_sum"
  top: "group0_block11_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block12_conv0"
  type: "Convolution"
  bottom: "group0_block11_sum"
  top: "group0_block12_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block12_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block12_conv0"
  top: "group0_block12_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block12_conv0_scale"
  type: "Scale"
  bottom: "group0_block12_conv0"
  top: "group0_block12_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block12_conv0_relu"
  type: "ReLU"
  bottom: "group0_block12_conv0"
  top: "group0_block12_conv0"
}
layer {
  name: "group0_block12_conv1"
  type: "Convolution"
  bottom: "group0_block12_conv0"
  top: "group0_block12_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block12_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block12_conv1"
  top: "group0_block12_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block12_conv1_scale"
  type: "Scale"
  bottom: "group0_block12_conv1"
  top: "group0_block12_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block12_sum"
  type: "Eltwise"
  bottom: "group0_block12_conv1"
  bottom: "group0_block11_sum"
  top: "group0_block12_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block13_conv0"
  type: "Convolution"
  bottom: "group0_block12_sum"
  top: "group0_block13_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block13_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block13_conv0"
  top: "group0_block13_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block13_conv0_scale"
  type: "Scale"
  bottom: "group0_block13_conv0"
  top: "group0_block13_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block13_conv0_relu"
  type: "ReLU"
  bottom: "group0_block13_conv0"
  top: "group0_block13_conv0"
}
layer {
  name: "group0_block13_conv1"
  type: "Convolution"
  bottom: "group0_block13_conv0"
  top: "group0_block13_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block13_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block13_conv1"
  top: "group0_block13_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block13_conv1_scale"
  type: "Scale"
  bottom: "group0_block13_conv1"
  top: "group0_block13_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block13_sum"
  type: "Eltwise"
  bottom: "group0_block13_conv1"
  bottom: "group0_block12_sum"
  top: "group0_block13_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block14_conv0"
  type: "Convolution"
  bottom: "group0_block13_sum"
  top: "group0_block14_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block14_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block14_conv0"
  top: "group0_block14_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block14_conv0_scale"
  type: "Scale"
  bottom: "group0_block14_conv0"
  top: "group0_block14_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block14_conv0_relu"
  type: "ReLU"
  bottom: "group0_block14_conv0"
  top: "group0_block14_conv0"
}
layer {
  name: "group0_block14_conv1"
  type: "Convolution"
  bottom: "group0_block14_conv0"
  top: "group0_block14_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block14_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block14_conv1"
  top: "group0_block14_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block14_conv1_scale"
  type: "Scale"
  bottom: "group0_block14_conv1"
  top: "group0_block14_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block14_sum"
  type: "Eltwise"
  bottom: "group0_block14_conv1"
  bottom: "group0_block13_sum"
  top: "group0_block14_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block15_conv0"
  type: "Convolution"
  bottom: "group0_block14_sum"
  top: "group0_block15_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block15_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block15_conv0"
  top: "group0_block15_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block15_conv0_scale"
  type: "Scale"
  bottom: "group0_block15_conv0"
  top: "group0_block15_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block15_conv0_relu"
  type: "ReLU"
  bottom: "group0_block15_conv0"
  top: "group0_block15_conv0"
}
layer {
  name: "group0_block15_conv1"
  type: "Convolution"
  bottom: "group0_block15_conv0"
  top: "group0_block15_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block15_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block15_conv1"
  top: "group0_block15_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block15_conv1_scale"
  type: "Scale"
  bottom: "group0_block15_conv1"
  top: "group0_block15_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block15_sum"
  type: "Eltwise"
  bottom: "group0_block15_conv1"
  bottom: "group0_block14_sum"
  top: "group0_block15_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block16_conv0"
  type: "Convolution"
  bottom: "group0_block15_sum"
  top: "group0_block16_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block16_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block16_conv0"
  top: "group0_block16_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block16_conv0_scale"
  type: "Scale"
  bottom: "group0_block16_conv0"
  top: "group0_block16_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block16_conv0_relu"
  type: "ReLU"
  bottom: "group0_block16_conv0"
  top: "group0_block16_conv0"
}
layer {
  name: "group0_block16_conv1"
  type: "Convolution"
  bottom: "group0_block16_conv0"
  top: "group0_block16_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block16_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block16_conv1"
  top: "group0_block16_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block16_conv1_scale"
  type: "Scale"
  bottom: "group0_block16_conv1"
  top: "group0_block16_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block16_sum"
  type: "Eltwise"
  bottom: "group0_block16_conv1"
  bottom: "group0_block15_sum"
  top: "group0_block16_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group0_block17_conv0"
  type: "Convolution"
  bottom: "group0_block16_sum"
  top: "group0_block17_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block17_conv0_bn"
  type: "BatchNorm"
  bottom: "group0_block17_conv0"
  top: "group0_block17_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block17_conv0_scale"
  type: "Scale"
  bottom: "group0_block17_conv0"
  top: "group0_block17_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block17_conv0_relu"
  type: "ReLU"
  bottom: "group0_block17_conv0"
  top: "group0_block17_conv0"
}
layer {
  name: "group0_block17_conv1"
  type: "Convolution"
  bottom: "group0_block17_conv0"
  top: "group0_block17_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group0_block17_conv1_bn"
  type: "BatchNorm"
  bottom: "group0_block17_conv1"
  top: "group0_block17_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group0_block17_conv1_scale"
  type: "Scale"
  bottom: "group0_block17_conv1"
  top: "group0_block17_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group0_block17_sum"
  type: "Eltwise"
  bottom: "group0_block17_conv1"
  bottom: "group0_block16_sum"
  top: "group0_block17_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block0_conv0"
  type: "Convolution"
  bottom: "group0_block17_sum"
  top: "group1_block0_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block0_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block0_conv0"
  top: "group1_block0_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block0_conv0_scale"
  type: "Scale"
  bottom: "group1_block0_conv0"
  top: "group1_block0_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block0_conv0_relu"
  type: "ReLU"
  bottom: "group1_block0_conv0"
  top: "group1_block0_conv0"
}
layer {
  name: "group1_block0_conv1"
  type: "Convolution"
  bottom: "group1_block0_conv0"
  top: "group1_block0_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block0_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block0_conv1"
  top: "group1_block0_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block0_conv1_scale"
  type: "Scale"
  bottom: "group1_block0_conv1"
  top: "group1_block0_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block0_proj"
  type: "Convolution"
  bottom: "group0_block17_sum"
  top: "group1_block0_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block0_proj_bn"
  type: "BatchNorm"
  bottom: "group1_block0_proj"
  top: "group1_block0_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block0_proj_scale"
  type: "Scale"
  bottom: "group1_block0_proj"
  top: "group1_block0_proj"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block0_sum"
  type: "Eltwise"
  bottom: "group1_block0_proj"
  bottom: "group1_block0_conv1"
  top: "group1_block0_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block1_conv0"
  type: "Convolution"
  bottom: "group1_block0_sum"
  top: "group1_block1_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block1_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block1_conv0"
  top: "group1_block1_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block1_conv0_scale"
  type: "Scale"
  bottom: "group1_block1_conv0"
  top: "group1_block1_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block1_conv0_relu"
  type: "ReLU"
  bottom: "group1_block1_conv0"
  top: "group1_block1_conv0"
}
layer {
  name: "group1_block1_conv1"
  type: "Convolution"
  bottom: "group1_block1_conv0"
  top: "group1_block1_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block1_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block1_conv1"
  top: "group1_block1_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block1_conv1_scale"
  type: "Scale"
  bottom: "group1_block1_conv1"
  top: "group1_block1_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block1_sum"
  type: "Eltwise"
  bottom: "group1_block1_conv1"
  bottom: "group1_block0_sum"
  top: "group1_block1_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block2_conv0"
  type: "Convolution"
  bottom: "group1_block1_sum"
  top: "group1_block2_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block2_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block2_conv0"
  top: "group1_block2_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block2_conv0_scale"
  type: "Scale"
  bottom: "group1_block2_conv0"
  top: "group1_block2_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block2_conv0_relu"
  type: "ReLU"
  bottom: "group1_block2_conv0"
  top: "group1_block2_conv0"
}
layer {
  name: "group1_block2_conv1"
  type: "Convolution"
  bottom: "group1_block2_conv0"
  top: "group1_block2_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block2_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block2_conv1"
  top: "group1_block2_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block2_conv1_scale"
  type: "Scale"
  bottom: "group1_block2_conv1"
  top: "group1_block2_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block2_sum"
  type: "Eltwise"
  bottom: "group1_block2_conv1"
  bottom: "group1_block1_sum"
  top: "group1_block2_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block3_conv0"
  type: "Convolution"
  bottom: "group1_block2_sum"
  top: "group1_block3_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block3_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block3_conv0"
  top: "group1_block3_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block3_conv0_scale"
  type: "Scale"
  bottom: "group1_block3_conv0"
  top: "group1_block3_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block3_conv0_relu"
  type: "ReLU"
  bottom: "group1_block3_conv0"
  top: "group1_block3_conv0"
}
layer {
  name: "group1_block3_conv1"
  type: "Convolution"
  bottom: "group1_block3_conv0"
  top: "group1_block3_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block3_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block3_conv1"
  top: "group1_block3_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block3_conv1_scale"
  type: "Scale"
  bottom: "group1_block3_conv1"
  top: "group1_block3_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block3_sum"
  type: "Eltwise"
  bottom: "group1_block3_conv1"
  bottom: "group1_block2_sum"
  top: "group1_block3_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block4_conv0"
  type: "Convolution"
  bottom: "group1_block3_sum"
  top: "group1_block4_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block4_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block4_conv0"
  top: "group1_block4_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block4_conv0_scale"
  type: "Scale"
  bottom: "group1_block4_conv0"
  top: "group1_block4_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block4_conv0_relu"
  type: "ReLU"
  bottom: "group1_block4_conv0"
  top: "group1_block4_conv0"
}
layer {
  name: "group1_block4_conv1"
  type: "Convolution"
  bottom: "group1_block4_conv0"
  top: "group1_block4_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block4_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block4_conv1"
  top: "group1_block4_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block4_conv1_scale"
  type: "Scale"
  bottom: "group1_block4_conv1"
  top: "group1_block4_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block4_sum"
  type: "Eltwise"
  bottom: "group1_block4_conv1"
  bottom: "group1_block3_sum"
  top: "group1_block4_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block5_conv0"
  type: "Convolution"
  bottom: "group1_block4_sum"
  top: "group1_block5_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block5_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block5_conv0"
  top: "group1_block5_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block5_conv0_scale"
  type: "Scale"
  bottom: "group1_block5_conv0"
  top: "group1_block5_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block5_conv0_relu"
  type: "ReLU"
  bottom: "group1_block5_conv0"
  top: "group1_block5_conv0"
}
layer {
  name: "group1_block5_conv1"
  type: "Convolution"
  bottom: "group1_block5_conv0"
  top: "group1_block5_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block5_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block5_conv1"
  top: "group1_block5_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block5_conv1_scale"
  type: "Scale"
  bottom: "group1_block5_conv1"
  top: "group1_block5_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block5_sum"
  type: "Eltwise"
  bottom: "group1_block5_conv1"
  bottom: "group1_block4_sum"
  top: "group1_block5_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block6_conv0"
  type: "Convolution"
  bottom: "group1_block5_sum"
  top: "group1_block6_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block6_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block6_conv0"
  top: "group1_block6_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block6_conv0_scale"
  type: "Scale"
  bottom: "group1_block6_conv0"
  top: "group1_block6_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block6_conv0_relu"
  type: "ReLU"
  bottom: "group1_block6_conv0"
  top: "group1_block6_conv0"
}
layer {
  name: "group1_block6_conv1"
  type: "Convolution"
  bottom: "group1_block6_conv0"
  top: "group1_block6_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block6_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block6_conv1"
  top: "group1_block6_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block6_conv1_scale"
  type: "Scale"
  bottom: "group1_block6_conv1"
  top: "group1_block6_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block6_sum"
  type: "Eltwise"
  bottom: "group1_block6_conv1"
  bottom: "group1_block5_sum"
  top: "group1_block6_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block7_conv0"
  type: "Convolution"
  bottom: "group1_block6_sum"
  top: "group1_block7_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block7_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block7_conv0"
  top: "group1_block7_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block7_conv0_scale"
  type: "Scale"
  bottom: "group1_block7_conv0"
  top: "group1_block7_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block7_conv0_relu"
  type: "ReLU"
  bottom: "group1_block7_conv0"
  top: "group1_block7_conv0"
}
layer {
  name: "group1_block7_conv1"
  type: "Convolution"
  bottom: "group1_block7_conv0"
  top: "group1_block7_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block7_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block7_conv1"
  top: "group1_block7_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block7_conv1_scale"
  type: "Scale"
  bottom: "group1_block7_conv1"
  top: "group1_block7_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block7_sum"
  type: "Eltwise"
  bottom: "group1_block7_conv1"
  bottom: "group1_block6_sum"
  top: "group1_block7_sum"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "group1_block8_conv0"
  type: "Convolution"
  bottom: "group1_block7_sum"
  top: "group1_block8_conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block8_conv0_bn"
  type: "BatchNorm"
  bottom: "group1_block8_conv0"
  top: "group1_block8_conv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block8_conv0_scale"
  type: "Scale"
  bottom: "group1_block8_conv0"
  top: "group1_block8_conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block8_conv0_relu"
  type: "ReLU"
  bottom: "group1_block8_conv0"
  top: "group1_block8_conv0"
}
layer {
  name: "group1_block8_conv1"
  type: "Convolution"
  bottom: "group1_block8_conv0"
  top: "group1_block8_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "group1_block8_conv1_bn"
  type: "BatchNorm"
  bottom: "group1_block8_conv1"
  top: "group1_block8_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "group1_block8_conv1_scale"
  type: "Scale"
  bottom: "group1_block8_conv1"
  top: "group1_block8_conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "group1_block8_sum"
  type: "Eltwise"
  bottom: "group1_block8_conv1"
  bottom: "group1_block7_sum"
  top: "group1_block8_sum"
  eltwise_param {
    operation: SUM
  }
}
